# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RadialArray..::..Create Method
RadialArray Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, View, ElementId, Int32, Line, Double, ArrayAnchorMember) | Creates a new radial array element from a single element based on an input rotation axis. |
| Create(Document, View, ICollection<(Of <<'(ElementId>)>>), Int32, Line, Double, ArrayAnchorMember) | Creates a new radial array element from a set of elements based on an input rotation axis. |

# See Also
RadialArray Class
RadialArray Members
Autodesk.Revit.DB Namespace